In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\sharath r\appdata\local\programs\python\python312\lib\site-packages (2.1.2)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\sharath r\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sharath r\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sharath r\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\sharath r\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\sharath r\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.1.2 -> 24.3.1
[notice] To update, run: C:\Users\sharath R\AppData\Local\Programs\Python\Python312\python.exe -m pip install --upgrade pip

In [3]:
import numpy as np
import pandas as pd

In [4]:
lst=[1,2,3,4,5]

In [5]:
numpy=np.array(lst)

In [6]:
numpy

array([1, 2, 3, 4, 5])

In [7]:
df=pd.DataFrame(lst)

In [8]:
pd.Series([lst,lst,lst,lst])

0    [1, 2, 3, 4, 5]
1    [1, 2, 3, 4, 5]
2    [1, 2, 3, 4, 5]
3    [1, 2, 3, 4, 5]
dtype: object

In [9]:
df=pd.DataFrame([lst,lst,lst,lst],columns=['a','b','c','d','e'])

In [10]:
df

   a  b  c  d  e
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5
3  1  2  3  4  5

In [11]:
data=pd.read_csv("data.csv")

In [12]:
data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [13]:
data['Gender']

0        Male
1      Female
2        Male
3      Female
4        Male
        ...
370    Female
371      Male
372    Female
373      Male
374    Female
Name: Gender, Length: 375, dtype: object

In [14]:
data['Age']

0      32.0
1      28.0
2      45.0
3      36.0
4      52.0
       ...
370    35.0
371    43.0
372    29.0
373    34.0
374    44.0
Name: Age, Length: 375, dtype: float64

In [15]:
#Checking Null Value

In [16]:
data.isnull()

       Age  Gender  Education Level  Job Title  Years of Experience  Salary
0    False   False            False      False                False   False
1    False   False            False      False                False   False
2    False   False            False      False                False   False
3    False   False            False      False                False   False
4    False   False            False      False                False   False
..     ...     ...              ...        ...                  ...     ...
370  False   False            False      False                False   False
371  False   False            False      False                False   False
372  False   False            False      False                False   False
373  False   False            False      False                False   False
374  False   False            False      False                False   False

[375 rows x 6 columns]

In [17]:
data.isnull().sum()

Age                    2
Gender                 2
Education Level        2
Job Title              2
Years of Experience    2
Salary                 2
dtype: int64

In [18]:
df=data.dropna()

In [19]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [20]:
#Finding experience level

In [21]:
data['Years of Experience']

0       5.0
1       3.0
2      15.0
3       7.0
4      20.0
       ...
370     8.0
371    19.0
372     2.0
373     7.0
374    15.0
Name: Years of Experience, Length: 375, dtype: float64

In [22]:
data['Years of Experience'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
370    False
371    False
372    False
373    False
374    False
Name: Years of Experience, Length: 375, dtype: bool

In [23]:
data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [24]:
float((sum(data["Salary"])))

nan

In [25]:
df=data["Education Level"].unique()

In [26]:
df

array(["Bachelor's", "Master's", 'PhD', nan], dtype=object)

In [27]:
df=data["Education Level"].nunique()

In [28]:
df

3

In [29]:
data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [30]:
categories={}
for name in  data["Job Title"].unique():
    count=0
    for i in data["Job Title"]:
        if i==name:
            count+=1
    categories[name]=count

print(categories)

{'Software Engineer': 1, 'Data Analyst': 2, 'Senior Manager': 2, 'Sales Associate': 2, 'Director': 1, 'Marketing Analyst': 2, 'Product Manager': 2, 'Sales Manager': 3, 'Marketing Coordinator': 3, 'Senior Scientist': 3, 'Software Developer': 1, 'HR Manager': 2, 'Financial Analyst': 1, 'Project Manager': 2, 'Customer Service Rep': 1, 'Operations Manager': 2, 'Marketing Manager': 1, 'Senior Engineer': 2, 'Data Entry Clerk': 1, 'Sales Director': 1, 'Business Analyst': 2, 'VP of Operations': 1, 'IT Support': 1, 'Recruiter': 2, 'Financial Manager': 1, 'Social Media Specialist': 1, 'Software Manager': 1, 'Junior Developer': 1, 'Senior Consultant': 1, 'Product Designer': 1, 'CEO': 1, 'Accountant': 1, 'Data Scientist': 1, 'Marketing Specialist': 1, 'Technical Writer': 1, 'HR Generalist': 2, 'Project Engineer': 1, 'Customer Success Rep': 1, 'Sales Executive': 1, 'UX Designer': 1, 'Operations Director': 1, 'Network Engineer': 1, 'Administrative Assistant': 2, 'Strategy Consultant': 1, 'Copywriter': 1, 'Account Manager': 1, 'Director of Marketing': 12, 'Help Desk Analyst': 1, 'Customer Service Manager': 2, 'Business Intelligence Analyst': 1, 'Event Coordinator': 2, 'VP of Finance': 1, 'Graphic Designer': 1, 'UX Researcher': 1, 'Social Media Manager': 1, 'Director of Operations': 11, 'Senior Data Scientist': 7, 'Junior Accountant': 3, 'Digital Marketing Manager': 1, 'IT Manager': 1, 'Customer Service Representative': 1, 'Business Development Manager': 1, 'Senior Financial Analyst': 7, 'Web Developer': 1, 'Research Director': 1, 'Technical Support Specialist': 1, 'Creative Director': 1, 'Senior Software Engineer': 6, 'Human Resources Director': 1, 'Content Marketing Manager': 1, 'Technical Recruiter': 1, 'Sales Representative': 1, 'Chief Technology Officer': 1, 'Junior Designer': 1, 'Financial Advisor': 1, 'Junior Account Manager': 2, 'Senior Project Manager': 7, 'Principal Scientist': 1, 'Supply Chain Manager': 1, 'Senior Marketing Manager': 9, 'Training Specialist': 1, 'Research Scientist': 1, 'Junior Software Developer': 2, 'Public Relations Manager': 1, 'Operations Analyst': 1, 'Product Marketing Manager': 1, 'Senior HR Manager': 3, 'Junior Web Developer': 1, 'Senior Project Coordinator': 5, 'Chief Data Officer': 1, 'Digital Content Producer': 1, 'IT Support Specialist': 1, 'Senior Marketing Analyst': 9, 'Customer Success Manager': 1, 'Senior Graphic Designer': 1, 'Software Project Manager': 1, 'Supply Chain Analyst': 1, 'Senior Business Analyst': 10, 'Junior Marketing Analyst': 3, 'Office Manager': 1, 'Principal Engineer': 1, 'Junior HR Generalist': 2, 'Senior Product Manager': 6, 'Junior Operations Analyst': 5, 'Senior HR Generalist': 1, 'Sales Operations Manager': 1, 'Senior Software Developer': 3, 'Junior Web Designer': 1, 'Senior Training Specialist': 1, 'Senior Research Scientist': 1, 'Junior Sales Representative': 4, 'Junior Marketing Manager': 3, 'Junior Data Analyst': 1, 'Senior Product Marketing Manager': 1, 'Junior Business Analyst': 8, 'Senior Sales Manager': 2, 'Junior Marketing Specialist': 5, 'Junior Project Manager': 5, 'Senior Accountant': 2, 'Director of Sales': 1, 'Junior Recruiter': 1, 'Senior Business Development Manager': 4, 'Senior Product Designer': 5, 'Junior Customer Support Specialist': 1, 'Senior IT Support Specialist': 1, 'Junior Financial Analyst': 7, 'Senior Operations Manager': 5, 'Director of Human Resources': 2, 'Junior Software Engineer': 1, 'Senior Sales Representative': 2, 'Director of Product Management': 1, 'Junior Copywriter': 1, 'Senior Marketing Coordinator': 3, 'Senior Human Resources Manager': 2, 'Junior Business Development Associate': 7, 'Senior Account Manager': 1, 'Senior Researcher': 1, 'Junior HR Coordinator': 2, 'Director of Finance': 2, 'Junior Marketing Coordinator': 6, nan: 0, 'Junior Data Scientist': 1, 'Senior Operations Analyst': 2, 'Senior Human Resources Coordinator': 1, 'Senior UX Designer': 3, 'Junior Product Manager': 4, 'Senior Marketing Specialist': 4, 'Senior IT Project Manager': 1, 'Senior Quality Assurance Analyst': 1, 'Director of Sales and Marketing': 1, 'Senior Account Executive': 1, 'Director of Business Development': 1, 'Junior Social Media Manager': 1, 'Senior Human Resources Specialist': 1, 'Senior Data Analyst': 3, 'Director of Human Capital': 1, 'Junior Advertising Coordinator': 1, 'Junior UX Designer': 1, 'Senior Marketing Director': 1, 'Senior IT Consultant': 2, 'Senior Financial Advisor': 3, 'Junior Business Operations Analyst': 2, 'Junior Social Media Specialist': 1, 'Senior Product Development Manager': 1, 'Junior Operations Manager': 3, 'Senior Software Architect': 1, 'Junior Research Scientist': 1, 'Senior Financial Manager': 5, 'Senior HR Specialist': 1, 'Senior Data Engineer': 4, 'Junior Operations Coordinator': 1, 'Director of HR': 1, 'Senior Operations Coordinator': 4, 'Junior Financial Advisor': 1, 'Director of Engineering': 2}

In [31]:
#So we now know now each and every job title is containing how many roles in our dataset with the help of this analysis

In [32]:
#Total Numbers of male and female candidates in datasets

In [33]:
categories={}
for name in data["Gender"].unique():
            count=0
            for i in data["Gender"]:
                if i==name:
                  count+=1
            categories[name]=count
print(categories)

{'Male': 194, 'Female': 179, nan: 0}

In [34]:
data

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [35]:
#how many age groups present in the dataset and their counts

In [36]:
types={}
for name in data["Age"].unique():
    count=0
    for i in data["Age"]:
        if i==name:
            count+=1
    types[name]=count
print(types)

{32.0: 12, 28.0: 13, 45.0: 17, 36.0: 20, 52.0: 3, 29.0: 23, 42.0: 11, 31.0: 21, 26.0: 7, 38.0: 15, 48.0: 9, 35.0: 22, 40.0: 13, 27.0: 9, 44.0: 21, 33.0: 24, 39.0: 12, 25.0: 4, 51.0: 5, 34.0: 17, 47.0: 15, 30.0: 15, 41.0: 12, 37.0: 12, 24.0: 1, 43.0: 12, 50.0: 8, 46.0: 10, 49.0: 8, 23.0: 1, 53.0: 1, nan: 0}

In [37]:
len(data["Job Title"])

375

In [39]:
data['Gender'].describe()

count      373
unique       2
top       Male
freq       194
Name: Gender, dtype: object

In [40]:
data['Salary'].describe()

count       373.000000
mean     100577.345845
std       48240.013482
min         350.000000
25%       55000.000000
50%       95000.000000
75%      140000.000000
max      250000.000000
Name: Salary, dtype: float64

In [41]:
data['Education Level'].describe()

count            373
unique             3
top       Bachelor's
freq             224
Name: Education Level, dtype: object